Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesNotIntersect Property
 Can't project Analytical Model. Planes do not intersect each other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProjectionPlanesNotIntersect { get; }
Public Shared ReadOnly Property ProjectionPlanesNotIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProjectionPlanesNotIntersect {
	FailureDefinitionId^ get ();
}
static member ProjectionPlanesNotIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace